PR_postprocess_vectorize_tiled/e2e/Qwen3.5-9B/tiled_16_16_num.txt
postprocess_vectorize_tiled f10277a9ca36d70ce67738ffa8fc2a08260d5ef7

Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0xe8a524d21940>, trust_remote_code=False, seed=42, num_prompts=500, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=500, random_output_len=5330, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=16, model='Qwen/Qwen3.5-9B', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,99', goodput=None, request_id_prefix='bench-352c33f6-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 07-20 13:11:59 [utils.py:90] Sampling input_len from [500, 500] and output_len from [5330, 5330]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 16
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     500       
Failed requests:                         0         
Maximum request concurrency:             16        
Benchmark duration (s):                  421.97    
Total input tokens:                      250000    
Total generated tokens:                  2665000   
Request throughput (req/s):              1.18      
Output token throughput (tok/s):         6315.68   
Peak output token throughput (tok/s):    2456.00   
Peak concurrent requests:                30.00     
Total token throughput (tok/s):          6908.14   
---------------Time to First Token----------------
Mean TTFT (ms):                          103.70    
Median TTFT (ms):                        83.15     
P50 TTFT (ms):                           83.15     
P90 TTFT (ms):                           154.80    
P99 TTFT (ms):                           351.73    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          2.42      
Median TPOT (ms):                        2.38      
P50 TPOT (ms):                           2.38      
P90 TPOT (ms):                           2.59      
P99 TPOT (ms):                           3.02      
---------------Inter-token Latency----------------
Mean ITL (ms):                           7.22      
Median ITL (ms):                         6.91      
P50 ITL (ms):                            6.91      
P90 ITL (ms):                            9.17      
P99 ITL (ms):                            16.55     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          13022.62  
Median E2EL (ms):                        12753.09  
P50 E2EL (ms):                           12753.09  
P90 E2EL (ms):                           13879.64  
P99 E2EL (ms):                           16177.33  
---------------Speculative Decoding---------------
Acceptance rate (%):                     98.84     
Acceptance length:                       2.98      
Drafts:                                  895250    
Draft tokens:                            1790500   
Accepted tokens:                         1769797   
Per-position acceptance (%):
  Position 0:                            99.41     
  Position 1:                            98.27     
==================================================
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0xf35b6ca81940>, trust_remote_code=False, seed=42, num_prompts=500, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=500, random_output_len=5330, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=16, model='Qwen/Qwen3.5-9B', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,99', goodput=None, request_id_prefix='bench-5f8ef8ff-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 07-20 13:19:26 [utils.py:90] Sampling input_len from [500, 500] and output_len from [5330, 5330]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 16
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     500       
Failed requests:                         0         
Maximum request concurrency:             16        
Benchmark duration (s):                  421.67    
Total input tokens:                      250000    
Total generated tokens:                  2665000   
Request throughput (req/s):              1.19      
Output token throughput (tok/s):         6320.16   
Peak output token throughput (tok/s):    2450.00   
Peak concurrent requests:                30.00     
Total token throughput (tok/s):          6913.04   
---------------Time to First Token----------------
Mean TTFT (ms):                          101.88    
Median TTFT (ms):                        84.39     
P50 TTFT (ms):                           84.39     
P90 TTFT (ms):                           155.16    
P99 TTFT (ms):                           239.70    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          2.42      
Median TPOT (ms):                        2.38      
P50 TPOT (ms):                           2.38      
P90 TPOT (ms):                           2.59      
P99 TPOT (ms):                           3.01      
---------------Inter-token Latency----------------
Mean ITL (ms):                           7.21      
Median ITL (ms):                         6.90      
P50 ITL (ms):                            6.90      
P90 ITL (ms):                            9.19      
P99 ITL (ms):                            16.32     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          13019.30  
Median E2EL (ms):                        12752.44  
P50 E2EL (ms):                           12752.44  
P90 E2EL (ms):                           13881.98  
P99 E2EL (ms):                           16141.74  
---------------Speculative Decoding---------------
Acceptance rate (%):                     98.67     
Acceptance length:                       2.97      
Drafts:                                  896274    
Draft tokens:                            1792548   
Accepted tokens:                         1768770   
Per-position acceptance (%):
  Position 0:                            99.28     
  Position 1:                            98.07     
==================================================
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0xf9b4c4541940>, trust_remote_code=False, seed=42, num_prompts=500, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=500, random_output_len=5330, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=16, model='Qwen/Qwen3.5-9B', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,99', goodput=None, request_id_prefix='bench-80bb96b1-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 07-20 13:26:53 [utils.py:90] Sampling input_len from [500, 500] and output_len from [5330, 5330]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 16
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     500       
Failed requests:                         0         
Maximum request concurrency:             16        
Benchmark duration (s):                  420.53    
Total input tokens:                      250000    
Total generated tokens:                  2665000   
Request throughput (req/s):              1.19      
Output token throughput (tok/s):         6337.28   
Peak output token throughput (tok/s):    2437.00   
Peak concurrent requests:                30.00     
Total token throughput (tok/s):          6931.77   
---------------Time to First Token----------------
Mean TTFT (ms):                          100.63    
Median TTFT (ms):                        82.35     
P50 TTFT (ms):                           82.35     
P90 TTFT (ms):                           154.49    
P99 TTFT (ms):                           243.70    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          2.42      
Median TPOT (ms):                        2.37      
P50 TPOT (ms):                           2.37      
P90 TPOT (ms):                           2.62      
P99 TPOT (ms):                           3.11      
---------------Inter-token Latency----------------
Mean ITL (ms):                           7.20      
Median ITL (ms):                         6.89      
P50 ITL (ms):                            6.89      
P90 ITL (ms):                            9.20      
P99 ITL (ms):                            16.31     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          13003.25  
Median E2EL (ms):                        12719.26  
P50 E2EL (ms):                           12719.26  
P90 E2EL (ms):                           14052.68  
P99 E2EL (ms):                           16643.04  
---------------Speculative Decoding---------------
Acceptance rate (%):                     98.70     
Acceptance length:                       2.97      
Drafts:                                  896119    
Draft tokens:                            1792238   
Accepted tokens:                         1768926   
Per-position acceptance (%):
  Position 0:                            99.29     
  Position 1:                            98.11     
==================================================
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0xe313115a1940>, trust_remote_code=False, seed=42, num_prompts=500, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=500, random_output_len=5330, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=16, model='Qwen/Qwen3.5-9B', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,99', goodput=None, request_id_prefix='bench-11abb709-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 07-20 13:34:18 [utils.py:90] Sampling input_len from [500, 500] and output_len from [5330, 5330]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 16
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     500       
Failed requests:                         0         
Maximum request concurrency:             16        
Benchmark duration (s):                  420.54    
Total input tokens:                      250000    
Total generated tokens:                  2665000   
Request throughput (req/s):              1.19      
Output token throughput (tok/s):         6337.03   
Peak output token throughput (tok/s):    2464.00   
Peak concurrent requests:                30.00     
Total token throughput (tok/s):          6931.50   
---------------Time to First Token----------------
Mean TTFT (ms):                          100.56    
Median TTFT (ms):                        82.45     
P50 TTFT (ms):                           82.45     
P90 TTFT (ms):                           160.94    
P99 TTFT (ms):                           238.00    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          2.42      
Median TPOT (ms):                        2.37      
P50 TPOT (ms):                           2.37      
P90 TPOT (ms):                           2.63      
P99 TPOT (ms):                           3.06      
---------------Inter-token Latency----------------
Mean ITL (ms):                           7.20      
Median ITL (ms):                         6.88      
P50 ITL (ms):                            6.88      
P90 ITL (ms):                            9.20      
P99 ITL (ms):                            16.36     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          13009.82  
Median E2EL (ms):                        12729.51  
P50 E2EL (ms):                           12729.51  
P90 E2EL (ms):                           14116.25  
P99 E2EL (ms):                           16416.68  
---------------Speculative Decoding---------------
Acceptance rate (%):                     98.65     
Acceptance length:                       2.97      
Drafts:                                  896394    
Draft tokens:                            1792788   
Accepted tokens:                         1768646   
Per-position acceptance (%):
  Position 0:                            99.28     
  Position 1:                            98.03     
==================================================